CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA0</name>
      <description>DMA controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0_Channel0</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel1</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel2</name>
       <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel3</name>
       <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel4</name>
       <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel5</name>
       <value>16</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel6</name>
       <value>17</value>
      </interrupt>
      <interrupt>
        <name>DMA0_Channel7</name>
       <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>INTF0</name>
          <displayName>INTF0</displayName>
          <description>Interrupt flag register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEEIF0</name>
              <description>FIFO error and exception of channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF0</name>
              <description>Single data mode exception of channel 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF0</name>
              <description>Transfer access error flag of channel 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF0</name>
              <description>Half transfer finish flag of channel 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF0</name>
              <description>Full Transfer finish flag of channel 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEEIF1</name>
              <description>FIFO error and exception of channel 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF1</name>
              <description>Single data mode exception of channel 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF1</name>
              <description>Transfer access error flag of channel 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF1</name>
              <description>Half transfer finish flag of channel 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF1</name>
              <description>Full Transfer finish flag of channel 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEEIF2</name>
              <description>FIFO error and exception of channel 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF2</name>
              <description>Single data mode exception of channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF2</name>
              <description>Transfer access error flag of channel 2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF2</name>
              <description>Half transfer finish flag of channel 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF2</name>
              <description>Full Transfer finish flag of channel 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEEIF3</name>
              <description>FIFO error and exception of channel 3</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF3</name>
              <description>Single data mode exception of channel 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF3</name>
              <description>Transfer access error flag of channel 3</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF3</name>
              <description>Half transfer finish flag of channel 3</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF3</name>
              <description>Full Transfer finish flag of channel 3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF1</name>
          <displayName>INTF1</displayName>
          <description>Interrupt flag register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FEEIF4</name>
              <description>FIFO error and exception of channel 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF4</name>
              <description>Single data mode exception of channel 4</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF4</name>
              <description>Transfer access error flag of channel 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF4</name>
              <description>Half transfer finish flag of channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF4</name>
              <description>Full Transfer finish flag of channel 4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEEIF5</name>
              <description>FIFO error and exception of channel 5</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF5</name>
              <description>Single data mode exception of channel 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF5</name>
              <description>Transfer access error flag of channel 5</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF5</name>
              <description>Half transfer finish flag of channel 5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF5</name>
              <description>Full Transfer finish flag of channel 5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEEIF6</name>
              <description>FIFO error and exception of channel 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF6</name>
              <description>Single data mode exception of channel 6</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF6</name>
              <description>Transfer access error flag of channel 6</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF6</name>
              <description>Half transfer finish flag of channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF6</name>
              <description>Full Transfer finish flag of channel 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FEEIF7</name>
              <description>FIFO error and exception of channel 7</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDEIF7</name>
              <description>Single data mode exception of channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TAEIF7</name>
              <description>Transfer access error flag of channel 7</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HTFIF7</name>
              <description>Half transfer finish flag of channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTFIF7</name>
              <description>Full Transfer finish flag of channel 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTC0</name>
          <displayName>INTC0</displayName>
          <description>Interrupt flag clear register 0</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>            
            <field>
              <name>FEEIFC0</name>
              <description>Clear bit for FIFO error and exception of channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC0</name>
              <description>Clear bit for single data mode exception of channel 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC0</name>
              <description>Clear bit for transfer access error flag of channel 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC0</name>
              <description>Clear bit for half transfer finish flag of channel 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC0</name>
              <description>Clear bit for Full transfer finish flag of channel 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FEEIFC1</name>
              <description>Clear bit for FIFO error and exception of channel 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC1</name>
              <description>Clear bit for single data mode exception of channel 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC1</name>
              <description>Clear bit for transfer access error flag of channel 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC1</name>
              <description>Clear bit for half transfer finish flag of channel 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC1</name>
              <description>Clear bit for Full transfer finish flag of channel 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>          
            <field>
              <name>FEEIFC2</name>
              <description>Clear bit for FIFO error and exception of channel 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC2</name>
              <description>Clear bit for single data mode exception of channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC2</name>
              <description>Clear bit for transfer access error flag of channel 2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC2</name>
              <description>Clear bit for half transfer finish flag of channel 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC2</name>
              <description>Clear bit for Full transfer finish flag of channel 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>          
            <field>
              <name>FEEIFC3</name>
              <description>Clear bit for FIFO error and exception of channel 3</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC3</name>
              <description>Clear bit for single data mode exception of channel 3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC3</name>
              <description>Clear bit for transfer access error flag of channel 3</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC3</name>
              <description>Clear bit for half transfer finish flag of channel 3</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC3</name>
              <description>Clear bit for Full transfer finish flag of channel 3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>               
          </fields>
        </register>
        <register>
          <name>INTC1</name>
          <displayName>INTC1</displayName>
          <description>Interrupt flag clear register 1</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>            
            <field>
              <name>FEEIFC4</name>
              <description>Clear bit for FIFO error and exception of channel 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC4</name>
              <description>Clear bit for single data mode exception of channel 4</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC4</name>
              <description>Clear bit for transfer access error flag of channel 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC4</name>
              <description>Clear bit for half transfer finish flag of channel 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC4</name>
              <description>Clear bit for Full transfer finish flag of channel 4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FEEIFC5</name>
              <description>Clear bit for FIFO error and exception of channel 5</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC5</name>
              <description>Clear bit for single data mode exception of channel 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC5</name>
              <description>Clear bit for transfer access error flag of channel 5</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC5</name>
              <description>Clear bit for half transfer finish flag of channel 5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC5</name>
              <description>Clear bit for Full transfer finish flag of channel 5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>          
            <field>
              <name>FEEIFC6</name>
              <description>Clear bit for FIFO error and exception of channel 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC6</name>
              <description>Clear bit for single data mode exception of channel 6</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC6</name>
              <description>Clear bit for transfer access error flag of channel 6</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC6</name>
              <description>Clear bit for half transfer finish flag of channel 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC6</name>
              <description>Clear bit for Full transfer finish flag of channel 6</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>          
            <field>
              <name>FEEIFC7</name>
              <description>Clear bit for FIFO error and exception of channel 7</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>SDEIFC7</name>
              <description>Clear bit for single data mode exception of channel 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>TAEIFC7</name>
              <description>Clear bit for transfer access error flag of channel 7</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>HTFIFC7</name>
              <description>Clear bit for half transfer finish flag of channel 7</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>           
            <field>
              <name>FTFIFC7</name>
              <description>Clear bit for Full transfer finish flag of channel 7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>               
          </fields>
        </register>
