CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>SECP_CFG</name>
          <displayName>SECP_CFG</displayName>
          <description>Secure protection configuration register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
           <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKPSECP</name>
              <description>BKP security protection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMVRSTFSECP</name>
              <description>Remove reset flag security protection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLI2SSECP</name>
              <description>PLLI2S configuration and status bits security protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLDIGSECP</name>
              <description>PLLDIG configuration and status bits security protection</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLSECP</name>
              <description>Main PLL configuration and status bits security protection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCSECP</name>
              <description>AHBx/APBx prescaler configuration bits security protection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCLKSECP</name>
              <description>SYSCLK clock selection, clock output on MCO configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LXTALSECP</name>
              <description>LXTAL clock configuration and status bits security protection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRC40KSECP</name>
              <description>IRC40K clock configuration and status bits security protection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HXTALSECP</name>
              <description>HXTAL clock configuration and status bits security protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRC16MSECP</name>
              <description>IRC16M clock configuration and status bits security protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

      <register>
          <name>SECP_STAT</name>
          <displayName>SECP_STAT</displayName>
          <description>Secure protection status register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BKPSECPF</name>
              <description>BKP security protection flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMVRSTFSECPF</name>
              <description>Remove reset flag security protection flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLI2SSECPF</name>
              <description>PLLI2S configuration and status bits security protection flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLDIGSECPF</name>
              <description>PLLDIG configuration and status bits security protection flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLLSECPF</name>
              <description>Main PLL configuration and status bits security protection flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCSECPF</name>
              <description>AHBx/APBx prescaler configuration bits security protection flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCLKSECPF</name>
              <description>SYSCLK clock selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LXTALSECPF</name>
              <description>LXTAL clock configuration and status bits security protection flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRC40KSECPF</name>
              <description>IRC40K clock configuration and status bits security protection flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HXTALSECPF</name>
              <description>HXTAL clock configuration and status bits security protection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRC16MSECPF</name>
              <description>IRC16M clock configuration and status bits security protection flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>AHB1SECP_STAT</name>
          <displayName>AHB1SECP_STAT</displayName>
          <description>AHB1 secure protection status register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00008007</resetValue>
          <fields>
            <field>
              <name>USBFSSECF</name>
              <description>USBFS security protection flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1SECF</name>
              <description>DMA1 security protection flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA0SECF</name>
              <description>DMA0 security protection flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3SECF</name>
              <description>SRAM3 security protection flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2SECF</name>
              <description>SRAM2 security protection flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1SECF</name>
              <description>SRAM1 security protection flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM0SECF</name>
              <description>SRAM0 security protection flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCSECF</name>
              <description>FMC security protection flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIFISECF</name>
              <description>WIFI security protection flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCSECF</name>
              <description>CRC security protection flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCSECF</name>
              <description>GPIO port C security protection flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBSECF</name>
              <description>GPIO port B security protection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PASECF</name>
              <description>GPIO port A security protection flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>


      <register>
          <name>AHB2SECP_STAT</name>
          <displayName>AHB2SECP_STAT</displayName>
          <description>AHB2 secure protection status register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRNGSECPF</name>
              <description>TRNG security protection flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HAUSECPF</name>
              <description>HAU security protection flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAUSECPF</name>
              <description>CAU security protection flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKCAUSECPF</name>
              <description>PKCAU security protection flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCISECPF</name>
              <description>DCI security protection flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

       <register>
          <name>AHB3SECP_STAT</name>
          <displayName>AHB3SECP_STAT</displayName>
          <description>AHB3 secure protection status register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>QSPISECPF</name>
              <description>QSPI security protection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPISECPF</name>
              <description>SQPI security protection flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>


        <register>
          <name>APB1SECP_STAT</name>
          <displayName>APB1SECP_STAT</displayName>
          <description>APB1 secure protection status register </description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMUSECPF</name>
              <description>PMU security protection flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1SECPF</name>
              <description>I2C1 security protection flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0SECPF</name>
              <description>I2C0 security protection flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0SECPF</name>
              <description>USART0 security protection flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1SECPF</name>
              <description>USART1 security protection flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1SECPF</name>
              <description>SPI1 security protection flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGTSECPF</name>
              <description>WWDGT security protection flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER5SECPF</name>
              <description>TIMER5 security protection flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER4SECPF</name>
              <description>TIMER4 security protection flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER3SECPF</name>
              <description>TIMER3 security protection flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2SECPF</name>
              <description>TIMER2 security protection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1SECPF</name>
              <description>TIMER1 security protection flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>   

        <register>
          <name>APB2SECP_STAT</name>
          <displayName>APB2SECP_STAT</displayName>
          <description>APB2 secure protection status register </description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RFSECPF</name>
              <description>RF security protection flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPDFSECPF</name>
              <description>HPDF security protection flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER16SECPF</name>
              <description>TIMER16 security protection flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER15SECPF</name>
              <description>TIMER15 security protection flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCFGSECPF</name>
              <description>SYSCFG security protection flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI0SECPF</name>
              <description>SPI0 security protection flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOSECPF</name>
              <description>SDIO security protection flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC0SECPF</name>
              <description>ADC0 security protection flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2SECPF</name>
              <description>USART2 security protection flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0SECPF</name>
              <description>TIMER0 security protection flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>   
