CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>VEC9</name>
          <displayName>VEC9</displayName>
          <description>TZBMPC2 vector register 9</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B_288</name>
              <description>blocks 288</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B_289</name>
              <description>blocks 289</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_290</name>
              <description>blocks290</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_291</name>
              <description>blocks291</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_292</name>
              <description>blocks292</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_293</name>
              <description>blocks293</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_294</name>
              <description>blocks294</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_295</name>
              <description>blocks295</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_296</name>
              <description>blocks296</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_297</name>
              <description>blocks297</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_298</name>
              <description>blocks298</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_299</name>
              <description>blocks299</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_300</name>
              <description>blocks300</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_301</name>
              <description>blocks301</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_302</name>
              <description>blocks302</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_303</name>
              <description>blocks303</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_304</name>
              <description>blocks304</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_305</name>
              <description>blocks305</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_306</name>
              <description>blocks306</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_307</name>
              <description>blocks307</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_308</name>
              <description>blocks308</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_309</name>
              <description>blocks309</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_310</name>
              <description>blocks310</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_311</name>
              <description>blocks311</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_312</name>
              <description>blocks312</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_313</name>
              <description>blocks313</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_314</name>
              <description>blocks314</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_315</name>
              <description>blocks315</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_316</name>
              <description>blocks316</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_317</name>
              <description>blocks317</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_318</name>
              <description>blocks318</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_319</name>
              <description>blocks319</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC10</name>
          <displayName>VEC10</displayName>
          <description>TZBMPC2 vector register 10</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B_320</name>
              <description>blocks 320</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B_321</name>
              <description>blocks 321</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_322</name>
              <description>blocks322</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_323</name>
              <description>blocks323</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_324</name>
              <description>blocks324</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_325</name>
              <description>blocks325</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_326</name>
              <description>blocks326</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_327</name>
              <description>blocks327</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_328</name>
              <description>blocks328</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_329</name>
              <description>blocks329</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_330</name>
              <description>blocks330</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_331</name>
              <description>blocks331</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_332</name>
              <description>blocks332</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_333</name>
              <description>blocks333</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_334</name>
              <description>blocks334</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_335</name>
              <description>blocks335</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_336</name>
              <description>blocks336</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_337</name>
              <description>blocks337</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_338</name>
              <description>blocks338</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_339</name>
              <description>blocks339</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_340</name>
              <description>blocks340</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_341</name>
              <description>blocks341</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_342</name>
              <description>blocks342</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_343</name>
              <description>blocks343</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_344</name>
              <description>blocks344</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_345</name>
              <description>blocks345</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_346</name>
              <description>blocks346</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_347</name>
              <description>blocks347</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_348</name>
              <description>blocks348</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_349</name>
              <description>blocks349</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_350</name>
              <description>blocks350</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_351</name>
              <description>blocks351</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>VEC11</name>
          <displayName>VEC11</displayName>
          <description>TZBMPC2 vector register 11</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B_352</name>
              <description>blocks 352</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B_353</name>
              <description>blocks 353</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_354</name>
              <description>blocks354</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_355</name>
              <description>blocks355</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_356</name>
              <description>blocks356</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_357</name>
              <description>blocks357</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_358</name>
              <description>blocks358</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_359</name>
              <description>blocks359</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_360</name>
              <description>blocks360</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_361</name>
              <description>blocks361</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_362</name>
              <description>blocks362</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_363</name>
              <description>blocks363</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_364</name>
              <description>blocks364</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_365</name>
              <description>blocks365</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_366</name>
              <description>blocks366</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_367</name>
              <description>blocks367</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_368</name>
              <description>blocks368</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_369</name>
              <description>blocks369</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_370</name>
              <description>blocks370</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_371</name>
              <description>blocks371</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_372</name>
              <description>blocks372</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_373</name>
              <description>blocks373</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_374</name>
              <description>blocks374</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_375</name>
              <description>blocks375</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_376</name>
              <description>blocks376</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_377</name>
              <description>blocks377</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_378</name>
              <description>blocks378</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_379</name>
              <description>blocks379</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_380</name>
              <description>blocks380</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_381</name>
              <description>blocks381</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_382</name>
              <description>blocks382</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_383</name>
              <description>blocks383</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

