CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>VEC12</name>
          <displayName>VEC12</displayName>
          <description>TZBMPC3 vector register 12</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B_384</name>
              <description>blocks 384</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B_385</name>
              <description>blocks 385</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_386</name>
              <description>blocks386</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_387</name>
              <description>blocks387</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_388</name>
              <description>blocks388</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_389</name>
              <description>blocks389</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_390</name>
              <description>blocks390</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_391</name>
              <description>blocks391</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_392</name>
              <description>blocks392</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_393</name>
              <description>blocks393</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_394</name>
              <description>blocks394</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_395</name>
              <description>blocks395</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_396</name>
              <description>blocks396</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_397</name>
              <description>blocks397</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_398</name>
              <description>blocks398</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_399</name>
              <description>blocks399</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_400</name>
              <description>blocks400</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_401</name>
              <description>blocks401</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_402</name>
              <description>blocks402</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_403</name>
              <description>blocks403</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_404</name>
              <description>blocks404</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_405</name>
              <description>blocks405</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_406</name>
              <description>blocks406</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_407</name>
              <description>blocks407</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_408</name>
              <description>blocks408</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_409</name>
              <description>blocks409</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_410</name>
              <description>blocks410</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_411</name>
              <description>blocks411</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_412</name>
              <description>blocks412</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_413</name>
              <description>blocks413</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_414</name>
              <description>blocks414</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_415</name>
              <description>blocks415</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 

          </fields>
        </register>

        <register>
          <name>VEC13</name>
          <displayName>VEC13</displayName>
          <description>TZBMPC3 vector register 13</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                      <fields>
                        <field>
              <name>B_416</name>
              <description>blocks 416</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                        <field>
              <name>B_417</name>
              <description>blocks 417</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_418</name>
              <description>blocks418</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_419</name>
              <description>blocks419</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_420</name>
              <description>blocks420</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_421</name>
              <description>blocks421</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_422</name>
              <description>blocks422</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_423</name>
              <description>blocks423</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_424</name>
              <description>blocks424</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_425</name>
              <description>blocks425</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_426</name>
              <description>blocks426</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_427</name>
              <description>blocks427</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_428</name>
              <description>blocks428</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_429</name>
              <description>blocks429</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_430</name>
              <description>blocks430</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_431</name>
              <description>blocks431</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_432</name>
              <description>blocks432</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_433</name>
              <description>blocks433</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_434</name>
              <description>blocks434</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_435</name>
              <description>blocks435</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_436</name>
              <description>blocks436</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_437</name>
              <description>blocks437</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_438</name>
              <description>blocks438</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_439</name>
              <description>blocks439</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_440</name>
              <description>blocks440</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_441</name>
              <description>blocks441</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_442</name>
              <description>blocks442</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_443</name>
              <description>blocks443</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_444</name>
              <description>blocks444</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_445</name>
              <description>blocks445</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_446</name>
              <description>blocks446</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_447</name>
              <description>blocks447</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC14</name>
          <displayName>VEC14</displayName>
          <description>TZBMPC3 vector register 14</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                      <fields>
                        <field>
              <name>B_448</name>
              <description>blocks 448</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                        <field>
              <name>B_449</name>
              <description>blocks 449</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_450</name>
              <description>blocks450</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_451</name>
              <description>blocks451</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_452</name>
              <description>blocks452</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_453</name>
              <description>blocks453</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_454</name>
              <description>blocks454</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_455</name>
              <description>blocks455</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_456</name>
              <description>blocks456</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_457</name>
              <description>blocks457</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_458</name>
              <description>blocks458</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_459</name>
              <description>blocks459</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_460</name>
              <description>blocks460</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_461</name>
              <description>blocks461</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_462</name>
              <description>blocks462</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_463</name>
              <description>blocks463</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_464</name>
              <description>blocks464</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_465</name>
              <description>blocks465</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_466</name>
              <description>blocks466</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_467</name>
              <description>blocks467</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_468</name>
              <description>blocks468</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_469</name>
              <description>blocks469</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_470</name>
              <description>blocks470</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_471</name>
              <description>blocks471</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_472</name>
              <description>blocks472</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_473</name>
              <description>blocks473</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_474</name>
              <description>blocks474</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_475</name>
              <description>blocks475</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_476</name>
              <description>blocks476</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_477</name>
              <description>blocks477</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_478</name>
              <description>blocks478</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_479</name>
              <description>blocks479</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

