CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>VEC15</name>
          <displayName>VEC15</displayName>
          <description>TZBMPC3 vector register 15</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                      <fields>
                        <field>
              <name>B_480</name>
              <description>blocks 480</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                        <field>
              <name>B_481</name>
              <description>blocks 481</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_482</name>
              <description>blocks482</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_483</name>
              <description>blocks483</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_484</name>
              <description>blocks484</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_485</name>
              <description>blocks485</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_486</name>
              <description>blocks486</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_487</name>
              <description>blocks487</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_488</name>
              <description>blocks488</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_489</name>
              <description>blocks489</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_490</name>
              <description>blocks490</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_491</name>
              <description>blocks491</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_492</name>
              <description>blocks492</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_493</name>
              <description>blocks493</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_494</name>
              <description>blocks494</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_495</name>
              <description>blocks495</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_496</name>
              <description>blocks496</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_497</name>
              <description>blocks497</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_498</name>
              <description>blocks498</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_499</name>
              <description>blocks499</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_500</name>
              <description>blocks500</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_501</name>
              <description>blocks501</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_502</name>
              <description>blocks502</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_503</name>
              <description>blocks503</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_504</name>
              <description>blocks504</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_505</name>
              <description>blocks505</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_506</name>
              <description>blocks506</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_507</name>
              <description>blocks507</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_508</name>
              <description>blocks508</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_509</name>
              <description>blocks509</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_510</name>
              <description>blocks510</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
             <field>
              <name>B_511</name>
              <description>blocks511</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC16</name>
          <displayName>VEC16</displayName>
          <description>TZBMPC3 vector register 16</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B_512</name>
              <description>blocks 512</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_513</name>
              <description>blocks 513</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_514</name>
              <description>blocks514</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_515</name>
              <description>blocks515</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_516</name>
              <description>blocks516</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_517</name>
              <description>blocks517</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_518</name>
              <description>blocks518</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_519</name>
              <description>blocks519</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_520</name>
              <description>blocks520</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_521</name>
              <description>blocks521</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_522</name>
              <description>blocks522</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_523</name>
              <description>blocks523</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_524</name>
              <description>blocks524</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_525</name>
              <description>blocks525</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_526</name>
              <description>blocks526</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_527</name>
              <description>blocks527</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_528</name>
              <description>blocks528</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_529</name>
              <description>blocks529</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_530</name>
              <description>blocks530</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_531</name>
              <description>blocks531</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_532</name>
              <description>blocks532</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_533</name>
              <description>blocks533</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_534</name>
              <description>blocks534</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_535</name>
              <description>blocks535</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_536</name>
              <description>blocks536</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_537</name>
              <description>blocks537</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_538</name>
              <description>blocks538</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_539</name>
              <description>blocks539</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_540</name>
              <description>blocks540</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_541</name>
              <description>blocks541</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_542</name>
              <description>blocks542</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_543</name>
              <description>blocks543</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC17</name>
          <displayName>VEC17</displayName>
          <description>TZBMPC3 vector register 17</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                       <fields>
                         <field>
              <name>B_544</name>
              <description>blocks 544</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                          <field>
              <name>B_545</name>
              <description>blocks 545</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_546</name>
              <description>blocks546</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_547</name>
              <description>blocks547</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_548</name>
              <description>blocks548</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_549</name>
              <description>blocks549</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_550</name>
              <description>blocks550</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_551</name>
              <description>blocks551</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_552</name>
              <description>blocks552</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_553</name>
              <description>blocks553</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_554</name>
              <description>blocks554</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_555</name>
              <description>blocks555</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_556</name>
              <description>blocks556</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_557</name>
              <description>blocks557</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_558</name>
              <description>blocks558</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_559</name>
              <description>blocks559</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_560</name>
              <description>blocks560</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_561</name>
              <description>blocks561</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_562</name>
              <description>blocks562</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_563</name>
              <description>blocks563</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_564</name>
              <description>blocks564</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_565</name>
              <description>blocks565</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_566</name>
              <description>blocks566</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_567</name>
              <description>blocks567</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_568</name>
              <description>blocks568</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_569</name>
              <description>blocks569</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_570</name>
              <description>blocks570</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_571</name>
              <description>blocks571</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_572</name>
              <description>blocks572</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_573</name>
              <description>blocks573</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_574</name>
              <description>blocks574</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_575</name>
              <description>blocks575</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>


