CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>VEC18</name>
          <displayName>VEC18</displayName>
          <description>TZBMPC3 vector register 18</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                       <fields>
                         <field>
              <name>B_576</name>
              <description>blocks 576</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                          <field>
              <name>B_577</name>
              <description>blocks 577</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_578</name>
              <description>blocks578</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_579</name>
              <description>blocks579</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_580</name>
              <description>blocks580</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_581</name>
              <description>blocks581</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_582</name>
              <description>blocks582</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_583</name>
              <description>blocks583</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_584</name>
              <description>blocks584</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_585</name>
              <description>blocks585</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_586</name>
              <description>blocks586</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_587</name>
              <description>blocks587</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_588</name>
              <description>blocks588</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_589</name>
              <description>blocks589</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_590</name>
              <description>blocks590</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_591</name>
              <description>blocks591</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_592</name>
              <description>blocks592</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_593</name>
              <description>blocks593</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_594</name>
              <description>blocks594</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_595</name>
              <description>blocks595</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_596</name>
              <description>blocks596</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_597</name>
              <description>blocks597</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_598</name>
              <description>blocks598</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_599</name>
              <description>blocks599</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_600</name>
              <description>blocks600</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_601</name>
              <description>blocks601</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_602</name>
              <description>blocks602</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_603</name>
              <description>blocks603</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_604</name>
              <description>blocks604</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_605</name>
              <description>blocks605</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_606</name>
              <description>blocks606</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_607</name>
              <description>blocks607</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC19</name>
          <displayName>VEC19</displayName>
          <description>TZBMPC3 vector register 19</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                       <fields>
                         <field>
              <name>B_608</name>
              <description>blocks 608</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                          <field>
              <name>B_609</name>
              <description>blocks 609</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_610</name>
              <description>blocks610</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_611</name>
              <description>blocks611</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_612</name>
              <description>blocks612</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_613</name>
              <description>blocks613</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_614</name>
              <description>blocks614</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_615</name>
              <description>blocks615</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_616</name>
              <description>blocks616</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_617</name>
              <description>blocks617</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_618</name>
              <description>blocks618</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_619</name>
              <description>blocks619</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_620</name>
              <description>blocks620</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_621</name>
              <description>blocks621</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_622</name>
              <description>blocks622</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_623</name>
              <description>blocks623</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_624</name>
              <description>blocks624</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_625</name>
              <description>blocks625</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_626</name>
              <description>blocks626</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_627</name>
              <description>blocks627</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_628</name>
              <description>blocks628</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_629</name>
              <description>blocks629</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_630</name>
              <description>blocks630</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_631</name>
              <description>blocks631</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_632</name>
              <description>blocks632</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_633</name>
              <description>blocks633</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_634</name>
              <description>blocks634</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_635</name>
              <description>blocks635</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_636</name>
              <description>blocks636</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_637</name>
              <description>blocks637</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_638</name>
              <description>blocks638</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_639</name>
              <description>blocks639</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC20</name>
          <displayName>VEC20</displayName>
          <description>TZBMPC3 vector register 20</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                       <fields>
                         <field>
              <name>B_640</name>
              <description>blocks 640</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                          <field>
              <name>B_641</name>
              <description>blocks 641</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_642</name>
              <description>blocks642</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_643</name>
              <description>blocks643</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_644</name>
              <description>blocks644</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_645</name>
              <description>blocks645</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_646</name>
              <description>blocks646</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_647</name>
              <description>blocks647</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_648</name>
              <description>blocks648</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_649</name>
              <description>blocks649</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_650</name>
              <description>blocks650</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_651</name>
              <description>blocks651</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_652</name>
              <description>blocks652</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_653</name>
              <description>blocks653</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_654</name>
              <description>blocks654</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_655</name>
              <description>blocks655</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_656</name>
              <description>blocks656</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_657</name>
              <description>blocks657</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_658</name>
              <description>blocks658</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_659</name>
              <description>blocks659</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_660</name>
              <description>blocks660</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_661</name>
              <description>blocks661</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_662</name>
              <description>blocks662</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_663</name>
              <description>blocks663</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_664</name>
              <description>blocks664</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_665</name>
              <description>blocks665</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_666</name>
              <description>blocks666</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_667</name>
              <description>blocks667</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_668</name>
              <description>blocks668</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_669</name>
              <description>blocks669</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_670</name>
              <description>blocks670</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_671</name>
              <description>blocks671</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

