CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>VEC21</name>
          <displayName>VEC21</displayName>
          <description>TZBMPC3 vector register 21</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                       <fields>
                         <field>
              <name>B_672</name>
              <description>blocks 672</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                          <field>
              <name>B_673</name>
              <description>blocks 673</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_674</name>
              <description>blocks674</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_675</name>
              <description>blocks675</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_676</name>
              <description>blocks676</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_677</name>
              <description>blocks677</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_678</name>
              <description>blocks678</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_679</name>
              <description>blocks679</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_680</name>
              <description>blocks680</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_681</name>
              <description>blocks681</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_682</name>
              <description>blocks682</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_683</name>
              <description>blocks683</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_684</name>
              <description>blocks684</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_685</name>
              <description>blocks685</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_686</name>
              <description>blocks686</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_687</name>
              <description>blocks687</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_688</name>
              <description>blocks688</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_689</name>
              <description>blocks689</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_690</name>
              <description>blocks690</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_691</name>
              <description>blocks691</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_692</name>
              <description>blocks692</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_693</name>
              <description>blocks693</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_694</name>
              <description>blocks694</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_695</name>
              <description>blocks695</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_696</name>
              <description>blocks696</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_697</name>
              <description>blocks697</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_698</name>
              <description>blocks698</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_699</name>
              <description>blocks699</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_700</name>
              <description>blocks700</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_701</name>
              <description>blocks701</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_702</name>
              <description>blocks702</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_703</name>
              <description>blocks703</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC22</name>
          <displayName>VEC22</displayName>
          <description>TZBMPC3 vector register 22</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                       <fields>
                         <field>
              <name>B_704</name>
              <description>blocks 704</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
                          <field>
              <name>B_705</name>
              <description>blocks 705</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>B_706</name>
              <description>blocks706</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_707</name>
              <description>blocks707</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_708</name>
              <description>blocks708</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_709</name>
              <description>blocks709</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_710</name>
              <description>blocks710</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_711</name>
              <description>blocks711</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_712</name>
              <description>blocks712</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_713</name>
              <description>blocks713</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_714</name>
              <description>blocks714</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_715</name>
              <description>blocks715</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_716</name>
              <description>blocks716</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_717</name>
              <description>blocks717</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_718</name>
              <description>blocks718</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_719</name>
              <description>blocks719</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_720</name>
              <description>blocks720</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_721</name>
              <description>blocks721</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_722</name>
              <description>blocks722</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_723</name>
              <description>blocks723</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_724</name>
              <description>blocks724</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_725</name>
              <description>blocks725</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_726</name>
              <description>blocks726</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_727</name>
              <description>blocks727</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_728</name>
              <description>blocks728</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_729</name>
              <description>blocks729</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_730</name>
              <description>blocks730</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_731</name>
              <description>blocks731</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_732</name>
              <description>blocks732</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_733</name>
              <description>blocks733</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_734</name>
              <description>blocks734</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
              <field>
              <name>B_735</name>
              <description>blocks735</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>

        <register>
          <name>VEC23</name>
          <displayName>VEC23</displayName>
          <description>TZBMPC3 vector register 23</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
                       <fields>
            <field>
              <name>B_736</name>
              <description>blocks 736</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>B_737</name>
              <description>blocks 737</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
 <field>
              <name>B_738</name>
              <description>blocks738</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_739</name>
              <description>blocks739</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_740</name>
              <description>blocks740</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_741</name>
              <description>blocks741</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_742</name>
              <description>blocks742</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_743</name>
              <description>blocks743</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_744</name>
              <description>blocks744</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_745</name>
              <description>blocks745</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_746</name>
              <description>blocks746</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_747</name>
              <description>blocks747</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_748</name>
              <description>blocks748</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_749</name>
              <description>blocks749</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_750</name>
              <description>blocks750</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_751</name>
              <description>blocks751</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_752</name>
              <description>blocks752</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_753</name>
              <description>blocks753</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_754</name>
              <description>blocks754</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_755</name>
              <description>blocks755</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_756</name>
              <description>blocks756</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_757</name>
              <description>blocks757</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_758</name>
              <description>blocks758</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_759</name>
              <description>blocks759</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_760</name>
              <description>blocks760</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_761</name>
              <description>blocks761</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_762</name>
              <description>blocks762</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_763</name>
              <description>blocks763</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_764</name>
              <description>blocks764</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_765</name>
              <description>blocks765</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_766</name>
              <description>blocks766</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
 <field>
              <name>B_767</name>
              <description>blocks767</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field> 
          </fields>
        </register>
