CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>LOCK0</name>
          <displayName>LOCK0</displayName>
          <description>TZBMPC1 lock register0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LKUB0</name>
              <description>lock/unlock status of secure access mode for the super-blocks 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB1</name>
              <description>lock/unlock status of secure access mode for the super-blocks 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB2</name>
              <description>lock/unlock status of secure access mode for the super-blocks 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB3</name>
              <description>lock/unlock status of secure access mode for the super-blocks 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB4</name>
              <description>lock/unlock status of secure access mode for the super-blocks 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB5</name>
              <description>lock/unlock status of secure access mode for the super-blocks 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB6</name>
              <description>lock/unlock status of secure access mode for the super-blocks 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB7</name>
              <description>lock/unlock status of secure access mode for the super-blocks 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB8</name>
              <description>lock/unlock status of secure access mode for the super-blocks 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB9</name>
              <description>lock/unlock status of secure access mode for the super-blocks 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB10</name>
              <description>lock/unlock status of secure access mode for the super-blocks 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB11</name>
              <description>lock/unlock status of secure access mode for the super-blocks 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB12</name>
              <description>lock/unlock status of secure access mode for the super-blocks 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB13</name>
              <description>lock/unlock status of secure access mode for the super-blocks 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB14</name>
              <description>lock/unlock status of secure access mode for the super-blocks 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB15</name>
              <description>lock/unlock status of secure access mode for the super-blocks 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB16</name>
              <description>lock/unlock status of secure access mode for the super-blocks 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB17</name>
              <description>lock/unlock status of secure access mode for the super-blocks 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB18</name>
              <description>lock/unlock status of secure access mode for the super-blocks 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB19</name>
              <description>lock/unlock status of secure access mode for the super-blocks 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB20</name>
              <description>lock/unlock status of secure access mode for the super-blocks 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB21</name>
              <description>lock/unlock status of secure access mode for the super-blocks 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB22</name>
              <description>lock/unlock status of secure access mode for the super-blocks 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKUB23</name>
              <description>lock/unlock status of secure access mode for the super-blocks 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
