CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TZBMPC3">
      <name>SEC_TZBMPC3</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x500B0400</baseAddress>
    </peripheral>

<peripheral>
      <name>TZIAC</name>
      <description>TrustZone illegal access controller</description>
      <groupName>TZPCU</groupName>
      <baseAddress>0x400A0400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TZIAC</name>  
        <value>99</value>
      </interrupt>
      <registers>
        <register>
          <name>INTEN0</name>
          <displayName>INTEN0</displayName>
          <description>TZIAC interrupt enable register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI0IE</name>
              <description>SPI0 illegal access interrupt enable bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0IE</name>
              <description>TIMER0 illegal access interrupt enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>USBFSIE</name>
              <description>USBFS illegal access interrupt enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>I2C1IE</name>
              <description>I2C1 illegal access interrupt enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>I2C0IE</name>
              <description>I2C0 illegal access interrupt enable bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>USART2IE</name>
              <description>USART2 illegal access interrupt enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>USART1IE</name>
              <description>USART1 illegal access interrupt enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>SPI1IE</name>
              <description>SPI1 illegal access interrupt enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>FWDGIE</name>
              <description>FWDG illegal access interrupt enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>WWDGIE</name>
              <description>WWDG illegal access interrupt enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>TIMER5IE</name>
              <description>TIMER5 illegal access interrupt enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>TIMER4IE</name>
              <description>TIMER4 illegal access interrupt enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>TIMER3IE</name>
              <description>TIMER3 illegal access interrupt enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>TIMER2IE</name>
              <description>TIMER2 illegal access interrupt enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
              <field>
              <name>TIMER1IE</name>
              <description>TIMER1 illegal access interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN1</name>
          <displayName>INTEN1</displayName>
          <description>TZIAC interrupt enable register 1</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTIIE</name>
              <description>EXTI illegal access interrupt enable bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCIE</name>
              <description>FLASH REG illegal access interrupt enable bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHIE</name>
              <description>FLASH illegal access interrupt enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCUIE</name>
              <description>RCU illegal access interrupt enable bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA1IE</name>
              <description>DMA1 illegal access interrupt enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA0IE</name>
              <description>DMA0 illegal access interrupt enable bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSCFGIE</name>
              <description>SYSCFG illegal access interrupt enable bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMUIE</name>
              <description>PWR illegal access interrupt enable bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCIE</name>
              <description>RTC illegal access interrupt enable bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDIOIE</name>
              <description>SDIO illegal access interrupt enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKCAUIE</name>
              <description>PKCAU illegal access interrupt enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNGIE</name>
              <description>RNG illegal access interrupt enable bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HAUIE</name>
              <description>HAU illegal access interrupt enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAUIE</name>
              <description>CAU illegal access interrupt enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIE</name>
              <description>ADC illegal access interrupt enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICACHEIE</name>
              <description>ICACHE_REG illegal access interrupt enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIIE</name>
              <description>TSI illegal access interrupt enable bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCIE</name>
              <description>CRC illegal access interrupt enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPDFIE</name>
              <description>HPDF illegal access interrupt enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER16IE</name>
              <description>TIMER16 illegal access interrupt enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER15IE</name>
              <description>TIMER15 illegal access interrupt enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART0IE</name>
              <description>USART0 illegal access interrupt enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>INTEN2</name>
          <displayName>INTEN2</displayName>
          <description>TZIAC interrupt enable register 2</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WIAN11NIE</name>
              <description>WIAN11N illegal access interrupt enable bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCMIIE</name>
              <description>DCMI illegal access interrupt enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2SADDIE</name>
              <description>I2SADD illegal access interrupt enable bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WIFI_RFIE</name>
              <description>WIFI RF illegal access interrupt enable bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHREGIE</name>
              <description>QSPI FLASHREG illegal access interrupt enable bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMREGIE</name>
              <description>SQPI PSRAMREG illegal access interrupt enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_FLASHIE</name>
              <description>QSPI FLASH illegal access interrupt enable bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SQPI_PSRAMIE</name>
              <description>SQPI PSRAM illegal access interrupt enable bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EFUSEIE</name>
              <description>EFUSE illegal access interrupt enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC3_REGIE</name>
              <description>TZBMPC3 REG illegal access interrupt enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3IE</name>
              <description>SRAM3 illegal access interrupt enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC2_REGIE</name>
              <description>TZBMPC2 REG illegal access interrupt enable bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2IE</name>
              <description>SRAM2 illegal access interrupt enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC1_REGIE</name>
              <description>TZBMPC1 REG illegal access interrupt enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1IE</name>
              <description>SRAM1 illegal access interrupt enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZBMPC0_REGIE</name>
              <description>TZBMPC0 REG illegal access interrupt enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM0IE</name>
              <description>SRAM0 illegal access interrupt enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZIACIE</name>
              <description>TZIAC illegal access interrupt enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZSPCIE</name>
              <description>TZSPC illegal access interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

        <register>
          <name>STAT0</name>
          <displayName>STAT0</displayName>
          <description>TZIAC status register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI0IAF</name>
              <description>SPI0 illegal access event flag bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER0IAF</name>
              <description>TIMER0 illegal access event flag bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBFSIAF</name>
              <description>USBFS illegal access event flag bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1IAF</name>
              <description>I2C1 illegal access flag bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C0IAF</name>
              <description>I2C0 illegal access flag bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART2IAF</name>
              <description>USART2 illegal access event flag bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USART1IAF</name>
              <description>USART1 illegal access event flag bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1IAF</name>
              <description>SPI1 illegal access event flag bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FWDGIAF</name>
              <description>FWDG illegal access event flag bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDGIAF</name>
              <description>WWDG illegal access event flag bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER5IAF</name>
              <description>TIMER5 illegal access event flag bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER4IAF</name>
              <description>TIMER4 illegal access event flag bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER3IAF</name>
              <description>TIMER3 illegal access event flag bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER2IAF</name>
              <description>TIMER2 illegal access event flag bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIMER1IAF</name>
              <description>TIMER1 illegal access event flag bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>

