CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
       <register>
          <name>CTXS12</name>
          <displayName>CTX12</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX12</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS13</name>
          <displayName>CTX13</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX13</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS14</name>
          <displayName>CTX14</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX14</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS15</name>
          <displayName>CTX15</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX15</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS16</name>
          <displayName>CTX16</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX16</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS17</name>
          <displayName>CTX17</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX17</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS18</name>
          <displayName>CTX18</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX18</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS19</name>
          <displayName>CTX19</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX19</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS20</name>
          <displayName>CTX20</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX20</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS21</name>
          <displayName>CTX21</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX21</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS22</name>
          <displayName>CTX22</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX22</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS23</name>
          <displayName>CTX23</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX23</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS24</name>
          <displayName>CTX24</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX24</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS25</name>
          <displayName>CTX25</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX25</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS26</name>
          <displayName>CTX26</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX26</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS27</name>
          <displayName>CTX27</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX27</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS28</name>
          <displayName>CTX28</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX28</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS29</name>
          <displayName>CTX29</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX29</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS30</name>
          <displayName>CTX30</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX30</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS31</name>
          <displayName>CTX31</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX31</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS32</name>
          <displayName>CTX32</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX32</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS33</name>
          <displayName>CTX33</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX33</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS34</name>
          <displayName>CTX34</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX34</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS35</name>
          <displayName>CTX35</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX35</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS36</name>
          <displayName>CTX36</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX36</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS37</name>
          <displayName>CTX37</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX37</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS38</name>
          <displayName>CTX38</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX38</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS39</name>
          <displayName>CTX39</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX39</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS40</name>
          <displayName>CTX40</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX40</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS41</name>
          <displayName>CTX41</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX41</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS42</name>
          <displayName>CTX42</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX42</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS43</name>
          <displayName>CTX43</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX43</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS44</name>
          <displayName>CTX44</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX44</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS45</name>
          <displayName>CTX45</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX45</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS46</name>
          <displayName>CTX46</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX46</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS47</name>
          <displayName>CTX47</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX47</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS48</name>
          <displayName>CTX48</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX48</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS49</name>
          <displayName>CTX49</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX49</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS50</name>
          <displayName>CTX50</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX50</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS51</name>
          <displayName>CTX51</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX51</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
