CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
       <register>
          <name>CTXS52</name>
          <displayName>CTX52</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX52</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
       <register>
          <name>CTXS53</name>
          <displayName>CTX53</displayName>
          <description>Context switch register x</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTX53</name>
              <description>The complete internal status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="HAU">
      <name>SEC_HAU</name>
      <disableCondition>!(DCB-&gt;DSCSR &amp; (1 &lt;&lt; 16))</disableCondition>
      <baseAddress>0x5C060400</baseAddress>
    </peripheral>

<peripheral>
      <name>HPDF</name>
      <description>High-Performance Digital Filter</description>
      <groupName>HPDF</groupName>
      <baseAddress>0x40016000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
     <interrupt>
        <name>HPDF0</name>
        <value>89</value>
      </interrupt>
     <interrupt>
        <name>HPDF1</name>
        <value>90</value>
      </interrupt>
      <registers>
        <register>
          <name>CH0CTL</name>
          <displayName>CH0CTL</displayName>
          <description>Channel 0 control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
	 <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HPDFEN</name>
              <description>Global enable for HPDF interface</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKOUTSEL</name>
              <description>Serial clock output source selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKOUTDM</name>
              <description>Serial clock output duty mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>Serial clock output divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DPM</name>
              <description>Data packing mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CMSD</name>
              <description>Channel 0 multiplexer select input data source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHPINSEL</name>
              <description>Channel inputs pins selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel 0 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKLEN</name>
              <description>Clock loss detector enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MMEN</name>
              <description>Malfunction monitor enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPICKSS</name>
              <description>SPI clock source select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SITYP</name>
              <description>Serial interface type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CTL</name>
          <displayName>CH1CTL</displayName>
          <description>Channel 1 control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
	 <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPM</name>
              <description>Data packing mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CMSD</name>
              <description>Channel 0 multiplexer select input data source</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CHPINSEL</name>
              <description>Channel inputs pins selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel 0 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKLEN</name>
              <description>Clock loss detector enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MMEN</name>
              <description>Malfunction monitor enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPICKSS</name>
              <description>SPI clock source select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SITYP</name>
              <description>Serial interface type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CFG0</name>
          <displayName>CH0CFG0</displayName>
          <description>Channel 0 configuration 0 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALOFF</name>
              <description>24-bit calibration offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>DTRS</name>
              <description>Data right bit-shift</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CFG0</name>
          <displayName>CH1CFG0</displayName>
          <description>Channel 1 configuration 0 register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CALOFF</name>
              <description>24-bit calibration offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>DTRS</name>
              <description>Data right bit-shift</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CFG1</name>
          <displayName>CH0CFG1</displayName>
          <description>Channel 0 configuration 1 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSFO</name>
              <description>Threshold monitor Sinc filter order selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TMFOR</name>
              <description>Threshold monitor filter oversampling rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MMBSD</name>
              <description>Malfunction monitor break signal distribution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MMCT</name>
              <description>Malfunction monitor counter threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CGF1</name>
          <displayName>CH1CFG1</displayName>
          <description>Channel 1 configuration 1 register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMSFO</name>
              <description>Threshold monitor Sinc filter order selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TMFOR</name>
              <description>Threshold monitor filter oversampling rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>MMBSD</name>
              <description>Malfunction monitor break signal distribution</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MMCT</name>
              <description>Malfunction monitor counter threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CH0TMFDT</name>
          <displayName>CH0TMFDT</displayName>
          <description>Channel 0 threshold monitor filter data register</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDATA</name>
              <description>Threshold monitor  data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CH1TMFDT</name>
          <displayName>CH1TMFDT</displayName>
          <description>Channel 0 threshold monitor filter data register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMDATA</name>
              <description>Threshold monitor  data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CH0PDI</name>
          <displayName>CH0PDI</displayName>
          <description>Channel 0 parallel data input register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATAIN1</name>
              <description>Data input 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DATAIN0</name>
              <description>Data input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      <register>
          <name>CH1PDI</name>
          <displayName>CH1PDI</displayName>
          <description>Channel 1 parallel data input register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATAIN1</name>
              <description>Data input 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DATAIN0</name>
              <description>Data input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CH0PS</name>
          <displayName>CH0PS</displayName>
          <description>Channel 0 pulse skip register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLSK</name>
              <description>Pulses to skip for input data skipping function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>CH1PS</name>
          <displayName>CH1PS</displayName>
          <description>Channel 1 pulse skip register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PLSK</name>
              <description>Pulses to skip for input data skipping function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0CTL0</name>
          <displayName>FLT0CTL0</displayName>
          <description>Filter 0 control register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMFM</name>
              <description>Threshold monitor fast mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAST</name>
              <description>Fast conversion mode enable for regular conversions </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCS</name>
              <description>Regular conversion channel selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCDMAEN</name>
              <description>DMA channel enabled to read data for the regular conversion</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCSYN</name>
              <description>Regular conversion synchronously</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCM</name>
              <description>Regular conversions continuous mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRCS</name>
              <description>Start regular channel conversion by software</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICTEEN</name>
              <description>Inserted conversions trigger edge enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ICTSSEL</name>
              <description>Inserted conversions trigger signal selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ICDMAEN</name>
              <description>DMA channel enabled to read data for the inserted channel group</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCMOD</name>
              <description>Scan conversion mode of inserted conversions</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICSYN</name>
              <description>Inserted conversion synchronously</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SICC</name>
              <description>Start inserted group channel conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLTEN</name>
              <description>Inserted conversions trigger signal selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1CTL0</name>
          <displayName>FLT1CTL0</displayName>
          <description>Filter 1 control register 0</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMFM</name>
              <description>Threshold monitor fast mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAST</name>
              <description>Fast conversion mode enable for regular conversions </description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCS</name>
              <description>Regular conversion channel selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCDMAEN</name>
              <description>DMA channel enabled to read data for the regular conversion</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCSYN</name>
              <description>Regular conversion synchronously</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCM</name>
              <description>Regular conversions continuous mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRCS</name>
              <description>Start regular channel conversion by software</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICTEEN</name>
              <description>Inserted conversions trigger edge enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ICTSSEL</name>
              <description>Inserted conversions trigger signal selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ICDMAEN</name>
              <description>DMA channel enabled to read data for the inserted channel group</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCMOD</name>
              <description>Scan conversion mode of inserted conversions</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICSYN</name>
              <description>Inserted conversion synchronously</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SICC</name>
              <description>Start inserted group channel conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLTEN</name>
              <description>Inserted conversions trigger signal selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
