CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
       <register>
          <name>FLT0CTL1</name>
          <displayName>FLT0CTL1</displayName>
          <description>Filter 0 control register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMCHEN</name>
              <description>Threshold monitor channel enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EMCS</name>
              <description>Extremes monitor channel selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKLIE</name>
              <description>Clock loss interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MMIE</name>
              <description>Malfunction monitor interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMIE</name>
              <description>Threshold monitor interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDOVRIE</name>
              <description>Regular data overflow interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDOVRIE</name>
              <description>Inserted data overflow interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCEIE</name>
              <description>Regular conversion end interrupt enable </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICEIE</name>
              <description>Inserted conversion end interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1CTL1</name>
          <displayName>FLT1CTL1</displayName>
          <description>Filter 1 control register 1</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMCHEN</name>
              <description>Threshold monitor channel enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EMCS</name>
              <description>Extremes monitor channel selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MMIE</name>
              <description>Malfunction monitor interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMIE</name>
              <description>Threshold monitor interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDOVRIE</name>
              <description>Regular data overflow interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDOVRIE</name>
              <description>Inserted data overflow interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCEIE</name>
              <description>Regular conversion end interrupt enable </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICEIE</name>
              <description>Inserted conversion end interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0STAT</name>
          <displayName>FLT0STAT</displayName>
          <description>Filter 0 status register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00030000</resetValue>
          <fields>
            <field>
              <name>MMF</name>
              <description>Malfunction monitor flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKLF</name>
              <description>Clock loss flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RCPF</name>
              <description>Regular conversion in progress flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICPF</name>
              <description>Inserted conversion in progress flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMEOF</name>
              <description>Threshold monitor event occurred flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCOF</name>
              <description>Regular conversion end flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICOF</name>
              <description>Inserted conversion overflow flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCEF</name>
              <description>Regular conversion end flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICEF</name>
              <description>Inserted conversion end flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1STAT</name>
          <displayName>FLT1STAT</displayName>
          <description>Filter 1 status register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00030000</resetValue>
          <fields>
            <field>
              <name>MMF</name>
              <description>Malfunction monitor flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKLF</name>
              <description>Clock loss flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RCPF</name>
              <description>Regular conversion in progress flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICPF</name>
              <description>Inserted conversion in progress flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMEOF</name>
              <description>Analog watchdog event occurred flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCOF</name>
              <description>Regular conversion end flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICOF</name>
              <description>Inserted conversion overflow flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCEF</name>
              <description>Regular conversion end flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICEF</name>
              <description>Inserted conversion end flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0INTC</name>
          <displayName>FLT0INTC</displayName>
          <description>Filter 0 interrupt flag clear register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MMFC</name>
              <description>Clear the malfunction monitor flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKLFC</name>
              <description>Clear the clock loss flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RCOFC</name>
              <description>Clear the regular conversion overflow flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICOFC</name>
              <description>Clear the inserted conversion overflow flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1INTC</name>
          <displayName>FLT1INTC</displayName>
          <description>Filter 1 interrupt flag clear register</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MMFC</name>
              <description>Clear the short-circuit detector flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RCOFC</name>
              <description>Clear the regular conversion overflow flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICOFC</name>
              <description>Clear the inserted conversion overflow flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0ICGS</name>
          <displayName>FLT0ICGS</displayName>
          <description>Filter 0 inserted  channel group selection register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ICGSEL</name>
              <description>Inserted channel group selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1ICGS</name>
          <displayName>FLT1ICGS</displayName>
          <description>Filter 1 inserted channel group  selection register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ICGSEL</name>
              <description>Inserted channel group selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0SFCTL</name>
          <displayName>FLT0SFCTL</displayName>
          <description>Filter 0 sinc filter control register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SFO</name>
              <description>Sinc filter order</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SFOR</name>
              <description>Sinc filter oversampling ratio</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>IOR</name>
              <description>Integrator oversampling ratio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1SFCTL</name>
          <displayName>FLT1SFCTL</displayName>
          <description>Filter 1 sinc filter control register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SFO</name>
              <description>Sinc filter order</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SFOR</name>
              <description>Sinc filter oversampling ratio</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>IOR</name>
              <description>Integrator oversampling ratio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0IDATA</name>
          <displayName>FLT0IDATA</displayName>
          <description>Filter 0 inserted group data register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Inserted group conversion data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>ICCH</name>
              <description>Inserted channel most recently converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1IDATA</name>
          <displayName>FLT1IDATA</displayName>
          <description>Filter 1 inserted group data register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Inserted group conversion data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>ICCH</name>
              <description>Inserted channel most recently converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0RDATA</name>
          <displayName>FLT0RDATA</displayName>
          <description>Filter 0 regular channel data register</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Regular channel conversion data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>RCHPDT</name>
              <description>Regular channel pending data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCH</name>
              <description>Regular channel most recently converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1RDATA</name>
          <displayName>FLT1RDATA</displayName>
          <description>Filter 1 regular channel data register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Regular channel conversion data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>RCHPDT</name>
              <description>Regular channel pending data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCH</name>
              <description>Regular channel most recently converted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0TMHT</name>
          <displayName>FLT0AWHT</displayName>
          <description>Filter 0 threshold monitor high threshold register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTVAL</name>
              <description>Threshold monitor high threshold value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>HTBSD</name>
              <description>High threshold event break signal distribution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1TMHT</name>
          <displayName>FLT1TMHT</displayName>
          <description>Filter 1 threshold monitor high threshold register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTVAL</name>
              <description>Threshold monitor high threshold value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>HTBSD</name>
              <description>High threshold event break signal distribution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0TMLT</name>
          <displayName>FLT0TMLT</displayName>
          <description>Filter 0 threshold monitor low threshold register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTVAL</name>
              <description>Threshold monitor low threshold value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>LTBSD</name>
              <description>Low threshold event break signal distribution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT1TMLT</name>
          <displayName>FLT1TMLT</displayName>
          <description>Filter 1 threshold monitor low threshold register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LTVAL</name>
              <description>Threshold monitor low threshold value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
            <field>
              <name>LTBSD</name>
              <description>Low threshold event break signal distribution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
       <register>
          <name>FLT0TMSTAT</name>
          <displayName>FLT0TMSTAT</displayName>
          <description>Filter 0 threshold monitor status register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTF</name>
              <description>Threshold monitor high threshold flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LTF</name>
              <description>Threshold monitor low threshold flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
