CommunityGD32Cores/platform-gd32/misc/svd/GD32W515Px.svd
        <register>
          <name>WTCNT</name>
          <displayName>WTCNT</displayName>
          <description>Wait cnt for indirect wire mode register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0007A120</resetValue>
          <fields>
            <field>
              <name>WTCNT</name>
              <description>Wait cnt when an indirect write operation is completed or aborted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPTMOUT</name>
          <displayName>SPTMOUT</displayName>
          <description>Timeout for staus polling mode register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPTMOUT</name>
              <description>Timeout cnt when a flitf transfer trys to abort a staus polling mode opertaion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLITF_SEC</name>
          <displayName>FLITF_SEC</displayName>
          <description>FLITF mode security configuration register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SECURE_FLITF</name>
              <description>Use for indicate if register of flitf mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTLF</name>
          <displayName>CTLF</displayName>
          <description>Control register in FLITF mode</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>PSCF</name>
              <description> The scaler factor for generating SCK</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKMODEF</name>
              <description> The SCK level in FLITF mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSHCF</name>
              <description> Chip select high cycle in FLITF mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SSAMPLEF</name>
              <description> Sample shift in FLITF mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TCFGF</name>
          <displayName>TCFGF</displayName>
          <description>Transfer configuration register in FLITF mode</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x01002503</resetValue>
          <fields>
            <field>
              <name>SIOOF</name>
              <description> Send instruction only once mode in FLITF mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAMODF</name>
              <description> Data mode in FLITF mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DUMYCF</name>
              <description> Number of dummy cycles in FLITF mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ALTESZF</name>
              <description> Alternate bytes size in FLITF mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ALTEMODF</name>
              <description> Alternate bytes mode in FLITF mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADDRSZF</name>
              <description> Address size in FLITF mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADDRMODF</name>
              <description> Address mode in FLITF mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>IMODF</name>
              <description>Instruction mode in FLITF mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INSTRUCTIONF</name>
              <description>Instruction in FLITF mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTEF</name>
          <displayName>ALTEF</displayName>
          <description>Alternate bytes register in FLITF mode</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALTEF</name>
              <description>Alternate Bytes in FLITF mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BYTE_CNT</name>
          <displayName>BYTE_CNT</displayName>
          <description>Complete bytes counter register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BYTECNT</name>
              <description>Remained Bytes which has been aborted by FLITF mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIV</name>
          <displayName>PRIV</displayName>
          <description>Privilege configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIV</name>
              <description>Use for indicate if register is privileged</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
